#+Title: HW7 Extra Credit
#+Author: Evan Stokdyk

* Visualization
This problem can be visuallized as such

#+begin_src python :results output :exports both :session visualization
import random
import pandas as pd

random.seed(42)

d = 3
size = 100 # The amount of input row to the model. Assumed to be infinate in the abstract

data = []

for _ in range(size):
    r = [random.random() for _ in range(d)]
    s = sum(r)
    y = 1 if s > (d / 2) else 0
    data.append([*r, y])

columns = [f'x{i+1}' for i in range(d)] + ['Y']

df = pd.DataFrame(data, columns=columns)

print(df.head(4))
#+end_src

#+RESULTS:
:          x1        x2        x3  Y
: 0  0.639427  0.025011  0.275029  0
: 1  0.223211  0.736471  0.676699  1
: 2  0.892180  0.086939  0.421922  0
: 3  0.029797  0.218638  0.505355  0

#+begin_src python :results output :exports both :session visualization
from sklearn.tree import DecisionTreeClassifier, export_text
from sklearn.metrics import accuracy_score

pick = [f'x{i+1}' for i in range(d)]
X = df[pick]
y = df.Y

clf = DecisionTreeClassifier(criterion='entropy')
clf.fit(X, y)

y_pred = clf.predict(X)

print("Accuracy: ", accuracy_score(y, y_pred))

print(export_text(clf))
#+end_src

#+RESULTS:
#+begin_example
Accuracy:  1.0
|--- feature_1 <= 0.61
|   |--- feature_2 <= 0.42
|   |   |--- class: 0
|   |--- feature_2 >  0.42
|   |   |--- feature_0 <= 0.55
|   |   |   |--- feature_2 <= 0.99
|   |   |   |   |--- feature_1 <= 0.50
|   |   |   |   |   |--- class: 0
|   |   |   |   |--- feature_1 >  0.50
|   |   |   |   |   |--- feature_0 <= 0.25
|   |   |   |   |   |   |--- class: 0
|   |   |   |   |   |--- feature_0 >  0.25
|   |   |   |   |   |   |--- class: 1
|   |   |   |--- feature_2 >  0.99
|   |   |   |   |--- class: 1
|   |   |--- feature_0 >  0.55
|   |   |   |--- feature_2 <= 0.52
|   |   |   |   |--- feature_1 <= 0.41
|   |   |   |   |   |--- class: 0
|   |   |   |   |--- feature_1 >  0.41
|   |   |   |   |   |--- class: 1
|   |   |   |--- feature_2 >  0.52
|   |   |   |   |--- class: 1
|--- feature_1 >  0.61
|   |--- feature_2 <= 0.16
|   |   |--- feature_0 <= 0.73
|   |   |   |--- class: 0
|   |   |--- feature_0 >  0.73
|   |   |   |--- class: 1
|   |--- feature_2 >  0.16
|   |   |--- class: 1
#+end_example

